app/views/users/_form.html.erb

  <%= form.label :store_id %>
  <%= form.collection_select :store_id, Store.all, :id, :name, include_blank: true %>
---
SELECT "stores".* FROM "stores"