app/views/users/edit.html.erb

SELECT "equipe_composer_items".* FROM "equipe_composer_items" WHERE "equipe_composer_items"."user_id" = $1  [["user_id", 3]]
SELECT 1 AS one FROM "equipe_composer_items" WHERE "equipe_composer_items"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
  <%= link_to "Back to users", users_path %> |
  <% if @user.equipe_composer_items.any? %>

SELECT "equipe_composer_items".* FROM "equipe_composer_items" WHERE "equipe_composer_items"."user_id" = $1  [["user_id", 3]]
---
    <ul>
      <% @user.equipe_composer_items.each do |item| %>