app/views/equipe_composers/_form.html.erb

    <div>
      <% User.all.each do |user| %>
        <div>
          <%= check_box_tag "equipe_composer[user_ids][]", user.id, equipe_composer.user_ids.include?(user.id) %>
---
SELECT "users".* FROM "users"
SELECT "users"."id" FROM "users" INNER JOIN "equipe_composer_items" ON "users"."id" = "equipe_composer_items"."user_id" WHERE "equipe_composer_items"."equipe_composer_id" = $1  [["equipe_composer_id", 4]]