app/views/equipe_composers/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "equipe_composer_items" ON "users"."id" = "equipe_composer_items"."user_id" WHERE "equipe_composer_items"."equipe_composer_id" = $1  [["equipe_composer_id", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "equipe_composer_items" ON "users"."id" = "equipe_composer_items"."user_id" WHERE "equipe_composer_items"."equipe_composer_id" = $1 LIMIT $2  [["equipe_composer_id", 1], ["LIMIT", 1]]
---
<h3>Users in this Team</h3>
<% if @equipe_composer.users.any? %>
  <% @equipe_composer.users.each do |user| %>