app/controllers/equipe_composers_controller.rb

  def index
    @equipe_composers = EquipeComposer.all
---
SELECT "equipe_composers".* FROM "equipe_composers"

  def create
    @equipe_composer = EquipeComposer.new(equipe_composer_params.except(:user_ids))

    respond_to do |format|
      if @equipe_composer.save
        if params[:equipe_composer][:user_ids].present?
          user_ids = params[:equipe_composer][:user_ids]
          user_ids.each do |user_id|
            EquipeComposerItem.create(equipe_composer_id: @equipe_composer.id, user_id: user_id)
---
INSERT INTO "equipe_composers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "anderson"], ["created_at", "2024-07-30 17:13:22.265798"], ["updated_at", "2024-07-30 17:13:22.265798"]]
INSERT INTO "equipe_composer_items" ("equipe_composer_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["equipe_composer_id", 4], ["user_id", 3], ["created_at", "2024-07-30 18:07:14.705043"], ["updated_at", "2024-07-30 18:07:14.705043"]]

  def set_equipe_composer
    @equipe_composer = EquipeComposer.find(params[:id])
---
SELECT "equipe_composers".* FROM "equipe_composers" WHERE "equipe_composers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]