app/controllers/stores_controller.rb

INSERT INTO "stores" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "lucas"], ["address", "lucas"], ["created_at", "2024-07-30 12:43:54.069159"], ["updated_at", "2024-07-30 12:43:54.069159"]]
---
  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save