app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.page(params[:page]).per(3)

INSERT INTO "users" ("name", "documentValue", "nasc", "created_at", "updated_at", "store_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["documentValue", ""], ["nasc", nil], ["created_at", "2024-07-30 13:08:18.597682"], ["updated_at", "2024-07-30 13:08:18.597682"], ["store_id", nil]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = $1, "documentValue" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Katia Ribeiro"], ["documentValue", "111222333"], ["updated_at", "2024-07-30 17:46:49.224869"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)